Revit 2027 API
PipeSettings.ConnectorTolerance Property
 The connector tolerance value.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double ConnectorTolerance { get; set; }
Public Property ConnectorTolerance As Double
	Get
	Set
public:
property double ConnectorTolerance {
	double get ();
	void set (double value);
}
member ConnectorTolerance : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The given value for dValue is not finite
See Also
Reference
PipeSettings Class
Autodesk.Revit.DB.Plumbing Namespace